package b_operation;

public class Operation_01 {
	public static void main(String[] args) {
		/*
		1. 연산자 기본
		  - 단항연산자
		    : ++, --, +, -, ~, !(not), (타입) 
		  - 이항연산자
		    : 산술연산자
		      -> +, -, *, /, %(나머지), <<, >>, >>>(쉬프트)
		    : 비교연산자
		      -> <, >, <=, >=, ==, !=, instanceof(객체지향할때배울꺼)
		    : 논리연산자
		      -> &(and), |(or), ^(엑스오어?), &&(and결합), ||(or결합) 
		  - 삼항연산자
		    : __?__:__ 이거맞아?맞으면이거:틀리면이거	 (T/F)	  
		  - 대입연산자
		    : =, op=(operation=),
		    
		    
		    
		2. 연산 우선순위 (무조건은 아니고 대략)
		  - 단항 > 이항 > 삼항 > 대입   (ex (int)3+5 하면 (int)3먼저하고 +5)
		  - 산술 > 비교 > 논리 > 대입
		  
		 
		 
		 
		 
		 
		 
		 
		 
		 
		 
		 
		 
		 
		 
		 
		*/
	}
}
